<template>
	<div>
		<div class="homeBox">
			<div class="contentBox">
				<div class="title">
					用户注册协议
				</div>
				<div>
					本协议服务条款(以下简称“服务条款”)是由用户(您)与浙江省绿色电力证书全生命周期管理平台(以下简称“平台”)之间就绿色电力证书核发、交易、划转、注销等服务所订立的相关权利义务规范。
					在您注册、使用平台及接受平台提供服务之前，请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款、法律适用和争议解决条款。免除或者限制责任的条款将以粗体下划线标识，您应重点阅读。
				</div>
				<div>1. 服务内容</div>
				<div>
					1.1平台所提供的服务将按照有关章程、服务条款和操作规则严格执行。用户通过注册程序点击“同意”
					按钮，即表示用户同意与平台达成本协议并接受所有的服务条款，本服务条款对用户和平台均具有法律效力。如果您不同意，请勿使用平台，您有充分且完全的权利退出使用平台服务（但这并不妨碍您浏览平台中的信息）。
				</div>
				<div>1.2平台保留在中华人民共和国大陆地区施行之法律允许的范围内独自决定拒绝服务、关闭用户账户、清除或编辑内容或取消订单的权利。</div>
				<div>2. 使用规则</div>
				<div>
					2.1
					用户在平台注册时，需提供完整、真实、准确、合法且最新有效的用户资料，并及时更新其注册资料。如果用户提供的资料不完整、不真实、不正确或未及时更新，或者有弄虚作假行为，用户自行承担因此引起的损失、责任及其他后果，并赔偿因此给平台造成的损失，且平台有权中止或终止用户使用平台。
				</div>
				<div>2.2 用户注册成功后，平台将给予每个用户一个用户账号及相应的密码，该用户账号和密码由用户自行负责保管；用户应当对以其用户账号进行的所有活动和事件负法律责任。</div>
				<div>2.3用户不得将在平台注册获得的账户出售、转让、赠与、转借、出租给他人使用或用于其他商业性用途，否则用户应承担由此产生的全部责任，并与实际使用人承担连带责任，同时平台有权中止或终止用户使用平台。
				</div>
				<div>2.4
					如平台按最后一次提供的信息与用户联系未果、用户未按平台的要求及时提供信息、用户提供的信息存在明显不实或经行政司法机关核实用户提供的信息无效的，用户将承担因此对用户自身、他人及平台造成的全部损失与不利后果。
				</div>
				<div>
					2.5 用户在平台注册后，必须遵守以下义务： (a) 遵守中国有关的法律和法规； (b) 不得为任何非法目的而使用平台； (c) 遵守所有与网络服务有关的网络协议、规定和程序； (d)
					不得利用平台进行任何可能对平台的正常运转造成不利影响的行为； (e)
					不得利用平台传输或发表任何骚扰性的、中伤他人的、辱骂性的、恐吓性的、庸俗淫秽的等任何非法的或不符合国家社会主义文明道德的信息资料； (f) 不得利用平台进行任何不利于平台的行为； (g)
					如发现任何非法使用用户账号或账号出现安全漏洞的情况，应立即通告平台； (h)
					在平台上申领中国绿色电力证书的可再生能源发电项目必须是未申请国际绿色电力证书的项目。
				</div>
				<div>3. 隐私保护</div>
				<div>
					3.1 保护用户隐私是平台的一项基本政策，平台保证不对外公开或向第三方提供用户注册资料及用户在使用网络服务时存储在平台的非公开内容（以下统称“用户信息”），但下列情况除外： (a)
					事先获得用户的明确授权； (b) 根据有关的法律法规要求； (c) 按照相关政府主管部门的要求； (d) 为维护社会公众的利益； (e)
					为维护平台的合法权益； (f) 其他确需公开、编辑、使用或透露用户信息的情况。
				</div>
				<div>
					3.2 用户同意平台对用户在注册时提供和使用过程中生成的信息依法进行收集和使用。用户同意经过处理无法识别特定主体且不能复原的信息可以提供给第三方。
				</div>
				<div>3.3 网络环境存在诸多不可预知因素，如用户使用平台时被第三方抓取甚至泄露信息，只要平台并未主动或故意泄露用户信息，则由用户自行承担风险，平台不承担任何责任。</div>
				<div>4. 账户安全规范</div>
				<div>
					4.1用户账户为用户自行设置并由您保管，因此，建议您务必保管好您的账户，并确保您在每个上网时段结束时退出登录并以正确步骤离开平台。账户因用户主动泄露或因用户遭受他人攻击、诈骗等行为导致的损失及后果，平台并不承担责任，用户应通过司法、行政等救济途径向侵权行为人追偿。
				</div>
				<div>4.2除平台存在过错外，用户应对您账户项下的所有行为结果（包括但不限于在线签署各类协议、发布信息、购买商品及服务及披露信息等）负责。</div>
				<div>
					4.3如发现任何未经授权使用用户账户登录平台或其他可能导致用户账户遭窃、遗失的情况，建议用户立即通知平台。用户理解平台对用户的任何请求采取行动均需要合理时间，且平台应用户请求而采取的行动可能无法避免或阻止侵害后果的形成或扩大，除平台存在重大过错外，平台不承担责任。
				</div>
				<div>5. 交易争议处理</div>
				<div>
					5.1用户在平台交易过程中与其他用户发生争议的，用户或其他用户中任何一方均有权选择以下途径解决： （一）与争议相对方自主协商； （二）请求消费者协会或者其他依法成立的调解组织调解；
					（三）向有关行政部门投诉； （四）根据与争议相对方达成的仲裁协议（如有）提请仲裁机构仲裁；
					（五）向人民法院提起诉讼。
				</div>
				<div>5.2如用户与平台就本服务条款内容或其执行发生任何争议，双方应尽力友好协商解决；协商不成时，任何一方均可向平台所在地有管辖权的人民法院提起诉讼。</div>
				<div>6. 协议更新及用户关注义务</div>
				<div>
					根据国家法律法规变化及网站运营需要，平台有权对本协议条款不时地进行修改，平台将提前七日在网站上公示修改后的协议，用户可通过网站公告进行查看，公示期为七日，修改后的协议将在公示期满后正式生效，并代替原来的协议。用户可随时登录查阅最新协议；用户有义务不时关注并阅读最新版的协议及网站公告，用户同意平台不承担单独通知义务。如用户不同意更新后的协议，可以且应立即停止接受平台依据本协议提供的服务；如用户继续使用平台提供的服务的，即视为同意更新后的协议。如果本协议中任何一条被视为废止、无效或因任何理由不可执行，该条应视为可分的且并不影响任何其余条款的有效性和可执行性。
				</div>
				<div>7. 免责声明</div>
				<div>7.1 用户明确同意其使用平台网络服务所存在的风险将完全由其自己承担；因其使用平台网络服务而产生的一切后果也由其自己承担，平台对用户不承担任何责任。</div>
				<div>
					7.2用户了解平台上的信息系用户自行发布，且可能存在风险。鉴于平台具备在海量信息及信息网络环境下信息与实物相分离的特点，平台无法逐一审查商品及/或服务的信息，无法逐一审查交易所涉及的商品及/或服务的质量、安全以及合法性、真实性、准确性，对此用户应谨慎判断。
				</div>
				<div>
					7.3 除非另有明确的书面说明,平台不担保网络服务一定能满足用户的要求，也不担保网络服务不会中断，对网络服务的及时性、安全性、准确性也都不作担保。
				</div>
				<div>8. 解释权 本协议的解释权归平台所有。如果其中有任何条款与国家的有关法律相抵触，则以国家法律的明文规定为准。</div>
				<div>感谢您的配合，祝您使用愉快！</div>
			</div>
		</div>
		<div class="checkbox">
			<a-checkbox @change="onChangeCheckBox">
				<span class="cur-pointer">我已经阅读并同意《浙江绿证认购平台用户注册协议》</span>
			</a-checkbox>
		</div>
		<div class="btnBox">
			<a-button @click="closeTheShow">
				取消
			</a-button>
			<a-button style="margin-left:60px" type="primary" @click="confirm">
				确定
			</a-button>
		</div>
	</div>
</template>

<script lang="ts">
	import {
		ref,
		defineComponent,
		inject
	} from 'vue'
	export default defineComponent({
		setup(props, context) {
			const visible:any = inject('visible')
			const openType:any = inject('openType')
			const $message:any = inject('$message')
			const isConsent = ref(false)
			const closeTheShow = () => {
				visible.value = false
			}
			const confirm = () => {
				if (!isConsent.value) {
					$message.warning('请勾选我已经阅读并同意《浙江绿证认购平台用户注册协议》后再操作')
				} else {
					openType.value = 'ZModal'
				}
			}
			const onChangeCheckBox = (e:any) => {
				isConsent.value = e.target.checked
			}
			return {
				isConsent,
				closeTheShow,
				confirm,
				onChangeCheckBox
			}
		}
	})
</script>

<style scoped>
	.checkbox {
		margin-top: 20px;
	}

	.homeBox {
		height: calc(100vh - 320px);
		overflow-x: hidden;
		overflow-y: auto;
	}

	.title {
		padding: 10px 0;
		text-align: center;
		font-size: 22px;
		font-weight: 400;
	}

	.contentBox {
		border: 1px solid #ebeaea;
		padding: 10px 25px;
		line-height: 28px;
		text-indent: 2em;
	}

	.cur-pointer {
		margin: 0;
		color: #006d6b;
	}

	.btnBox {
		margin-top: 15px;
		text-align: center;
	}
</style>
